# StairsInstUpLabelOn Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..StairsInstUpLabelOn Property
ParameterTypeId Class See Also
---
"Up label"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId StairsInstUpLabelOn { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property StairsInstUpLabelOn As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ StairsInstUpLabelOn {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace